-- MySQL dump 10.13  Distrib 9.3.0, for macos15.2 (arm64)
--
-- Host: localhost    Database: dugoutdb
-- ------------------------------------------------------
-- Server version	9.3.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `dugoutdb`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `dugoutdb` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `dugoutdb`;

--
-- Table structure for table `batters_1B`
--

DROP TABLE IF EXISTS `batters_1B`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `batters_1B` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `pa` int DEFAULT NULL,
  `ab` int DEFAULT NULL,
  `hr` int DEFAULT NULL,
  `rbi` int DEFAULT NULL,
  `battingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=267 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `batters_1B`
--

LOCK TABLES `batters_1B` WRITE;
/*!40000 ALTER TABLE `batters_1B` DISABLE KEYS */;
INSERT INTO `batters_1B` VALUES (248,'오스틴','25  1B',2.38,2,0,55,0,358.56),(249,'디아즈','25  1B',1.66,1,0,66,0,415.92),(250,'위즈덤','25  1B',1.43,1,0,29,0,191.16),(251,'양석환','25  1B',1.12,0,0,53,0,331.44),(252,'나승엽','25  1B',0.66,1,0,49,1,303.12),(253,'데이비슨','25  1B',0.57,0,0,35,0,216.84),(254,'최주환','25  1B',0.5,0,0,61,1,373.2),(255,'채은성','25  1B',0.46,0,0,56,1,342.72),(256,'고명준','25  1B',0.41,0,0,50,1,306.12),(257,'서호철','25  1B',0.27,0,0,30,0,183.24),(258,'도태훈','25  1B',0.13,0,0,10,1,62.76),(259,'김민수','25  1B',0.03,0,0,1,0,6.36),(260,'최항','25  1B',-0.06,0,0,0,0,-0.72),(261,'문정빈','25  1B',-0.08,0,0,2,0,11.04),(262,'황대인','25  1B',-0.12,0,0,5,0,28.56),(263,'문상철','25  1B',-0.15,0,0,27,1,161.4),(264,'강진성','25  1B',-0.18,0,0,2,0,9.84),(265,'윤준혁','25  1B',-0.18,0,0,1,0,3.84),(266,'김인환','25  1B',-0.3,0,0,0,0,-3.6);
/*!40000 ALTER TABLE `batters_1B` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `batters_2B`
--

DROP TABLE IF EXISTS `batters_2B`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `batters_2B` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `pa` int DEFAULT NULL,
  `ab` int DEFAULT NULL,
  `hr` int DEFAULT NULL,
  `rbi` int DEFAULT NULL,
  `battingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=463 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `batters_2B`
--

LOCK TABLES `batters_2B` WRITE;
/*!40000 ALTER TABLE `batters_2B` DISABLE KEYS */;
INSERT INTO `batters_2B` VALUES (430,'박민우','25  2B',2.24,1,0,51,5,338.88),(431,'고승민','25  2B',1.25,1,0,58,1,364.2),(432,'오명진','25  2B',0.97,0,0,37,2,236.04),(433,'류지혁','25  2B',0.88,0,0,50,0,310.56),(434,'양도근','25  2B',0.82,0,0,15,0,99.84),(435,'김선빈','25  2B',0.79,0,0,31,0,195.48),(436,'천성호','25  2B',0.72,0,0,11,1,75.84),(437,'구본혁','25  2B',0.52,0,0,35,1,217.44),(438,'신민재','25  2B',0.42,0,0,26,0,161.04),(439,'이유찬','25  2B',0.39,0,0,9,1,59.88),(440,'이영빈','25  2B',0.33,0,0,11,0,69.96),(441,'김상수','25  2B',0.25,0,0,24,0,147),(442,'박계범','25  2B',0.2,0,0,17,2,106.8),(443,'김한별','25  2B',0.17,0,0,8,0,50.04),(444,'이승현','25  2B',0.15,0,0,1,1,9),(445,'김규성','25  2B',0.14,0,0,20,0,121.68),(446,'이도윤','25  2B',0.13,0,0,20,2,123.96),(447,'윤도현','25  2B',0.1,0,0,10,0,61.2),(448,'정준재','25  2B',0.08,0,0,34,1,206.16),(449,'김주성','25  2B',0.04,0,0,1,0,6.48),(450,'홍종표','25  2B',0.04,0,0,8,0,48.48),(451,'최정용','25  2B',0.01,0,0,1,0,6.12),(452,'최정원','25  2B',0,0,0,7,0,42),(453,'김준상','25  2B',0,0,0,1,0,6),(454,'심재훈','25  2B',-0.01,0,0,5,0,29.88),(455,'서건창','25  2B',-0.02,0,0,3,0,17.76),(456,'박준순','25  2B',-0.08,0,0,1,0,5.04),(457,'서유신','25  2B',-0.11,0,0,0,0,-1.32),(458,'황영묵','25  2B',-0.12,0,0,36,0,214.56),(459,'오윤석','25  2B',-0.24,0,0,10,0,57.12),(460,'송지후','25  2B',-0.28,0,0,4,0,20.64),(461,'안주형','25  2B',-0.3,0,0,3,0,14.4),(462,'강민성','25  2B',-0.45,0,0,1,0,0.6);
/*!40000 ALTER TABLE `batters_2B` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `batters_3B`
--

DROP TABLE IF EXISTS `batters_3B`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `batters_3B` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `pa` int DEFAULT NULL,
  `ab` int DEFAULT NULL,
  `hr` int DEFAULT NULL,
  `rbi` int DEFAULT NULL,
  `battingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=365 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `batters_3B`
--

LOCK TABLES `batters_3B` WRITE;
/*!40000 ALTER TABLE `batters_3B` DISABLE KEYS */;
INSERT INTO `batters_3B` VALUES (339,'문보경','25  3B',2.96,3,0,63,0,413.52),(340,'송성문','25  3B',2.6,2,0,65,0,421.2),(341,'김도영','25  3B',1.47,1,0,33,0,215.64),(342,'황재균','25  3B',1.29,1,0,56,0,351.48),(343,'노시환','25  3B',1.09,1,0,52,1,326.28),(344,'강승호','25  3B',1,0,0,44,2,278.4),(345,'허경민','25  3B',0.58,0,0,34,0,210.96),(346,'김영웅','25  3B',0.49,0,0,43,1,265.08),(347,'전병우','25  3B',0.38,0,0,6,0,40.56),(348,'김성현','25  3B',0.33,0,0,16,0,99.96),(349,'임종성','25  3B',0.21,0,0,14,0,86.52),(350,'김민성','25  3B',0.19,0,0,19,0,116.28),(351,'손호영','25  3B',-0.01,0,0,35,0,209.88),(352,'양현종','25  3B',-0.06,0,0,0,0,-0.72),(353,'김찬형','25  3B',-0.09,0,0,4,0,22.92),(354,'이승원','25  3B',-0.13,0,0,0,0,-1.56),(355,'정현창','25  3B',-0.15,0,0,0,0,-1.8),(356,'변우혁','25  3B',-0.16,0,0,26,0,154.08),(357,'여동욱','25  3B',-0.16,0,0,4,0,22.08),(358,'전태현','25  3B',-0.16,0,0,21,0,124.08),(359,'고영우','25  3B',-0.25,0,0,0,0,-3),(360,'김수윤','25  3B',-0.26,0,0,1,0,2.88),(361,'안상현','25  3B',-0.28,0,0,23,1,135.84),(362,'석정우','25  3B',-0.29,0,0,2,0,8.52),(363,'박지환','25  3B',-0.79,0,0,8,0,38.52),(364,'김휘집','25  3B',-0.99,0,0,29,1,163.32);
/*!40000 ALTER TABLE `batters_3B` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `batters_C`
--

DROP TABLE IF EXISTS `batters_C`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `batters_C` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `pa` int DEFAULT NULL,
  `ab` int DEFAULT NULL,
  `hr` int DEFAULT NULL,
  `rbi` int DEFAULT NULL,
  `battingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=477 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `batters_C`
--

LOCK TABLES `batters_C` WRITE;
/*!40000 ALTER TABLE `batters_C` DISABLE KEYS */;
INSERT INTO `batters_C` VALUES (443,'박동원','25  C',3.6,3,0,53,0,361.2),(444,'양의지','25  C',2.88,2,0,61,0,400.56),(445,'유강남','25  C',1.6,1,0,36,0,235.2),(446,'최재훈','25  C',1.27,1,0,26,0,171.24),(447,'김형준','25  C',1.21,1,0,29,1,189.72),(448,'장성우','25  C',1.11,1,0,39,0,247.32),(449,'강민호','25  C',1,0,0,47,0,294),(450,'이주헌','25  C',0.62,0,0,8,0,55.44),(451,'김태군','25  C',0.46,0,0,20,0,125.52),(452,'김기연','25  C',0.32,0,0,22,0,135.84),(453,'조형우','25  C',0.25,0,0,26,0,159),(454,'신범수','25  C',0.2,0,0,4,0,26.4),(455,'조대현','25  C',0.14,0,0,2,0,13.68),(456,'김건희','25  C',0.13,0,0,19,1,116.76),(457,'김정호','25  C',0.1,0,0,2,0,13.2),(458,'한승택','25  C',0.1,0,0,4,0,25.2),(459,'이재원','25  C',0.1,0,0,13,1,80.4),(460,'손성빈','25  C',0.1,0,0,1,0,7.2),(461,'정보근','25  C',0.09,0,0,18,1,110.28),(462,'허인서','25  C',0.08,0,0,1,0,6.96),(463,'이지영','25  C',0.08,0,0,19,1,116.16),(464,'김성우','25  C',0,0,0,1,0,6),(465,'박재엽','25  C',0,0,0,1,0,6),(466,'이율예','25  C',-0.03,0,0,0,0,-0.36),(467,'김동헌','25  C',-0.04,0,0,9,0,53.52),(468,'한준수','25  C',-0.07,0,0,19,0,113.16),(469,'장승현','25  C',-0.08,0,0,0,0,-0.96),(470,'안중열','25  C',-0.12,0,0,1,0,4.56),(471,'강현우','25  C',-0.14,0,0,2,0,10.32),(472,'김재성','25  C',-0.15,0,0,2,0,10.2),(473,'류현준','25  C',-0.15,0,0,1,0,4.2),(474,'이병헌','25  C',-0.21,0,0,2,0,9.48),(475,'김재현','25  C',-0.43,0,0,17,0,96.84),(476,'박세혁','25  C',-0.54,0,0,7,0,35.52);
/*!40000 ALTER TABLE `batters_C` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `batters_CF`
--

DROP TABLE IF EXISTS `batters_CF`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `batters_CF` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `pa` int DEFAULT NULL,
  `ab` int DEFAULT NULL,
  `hr` int DEFAULT NULL,
  `rbi` int DEFAULT NULL,
  `battingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=351 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `batters_CF`
--

LOCK TABLES `batters_CF` WRITE;
/*!40000 ALTER TABLE `batters_CF` DISABLE KEYS */;
INSERT INTO `batters_CF` VALUES (326,'김성윤','25  CF',3.05,2,0,64,3,424.2),(327,'플로리얼','25  CF',1.78,1,0,63,2,401.76),(328,'정수빈','25  CF',1.44,1,0,53,0,335.28),(329,'이주형','25  CF',1.42,0,0,36,0,233.04),(330,'박해민','25  CF',1.28,0,0,41,2,263.76),(331,'최지훈','25  CF',1.05,1,0,67,2,417),(332,'천재환','25  CF',0.93,0,0,29,2,187.56),(333,'장두성','25  CF',0.64,0,0,35,0,217.68),(334,'김지찬','25  CF',0.64,0,0,34,1,212.88),(335,'한석현','25  CF',0.48,0,0,17,0,107.76),(336,'박정우','25  CF',0.38,0,0,14,0,88.56),(337,'황성빈','25  CF',0.37,0,0,36,1,221.64),(338,'장진혁','25  CF',0.09,0,0,7,1,44.28),(339,'김호령','25  CF',-0.1,0,0,10,0,58.8),(340,'유로결','25  CF',-0.13,0,0,0,0,-1.56),(341,'김재혁','25  CF',-0.16,0,0,0,0,-1.92),(342,'전다민','25  CF',-0.19,0,0,0,0,-2.28),(343,'이용규','25  CF',-0.22,0,0,6,0,33.36),(344,'박수종','25  CF',-0.28,0,0,1,0,2.64),(345,'장재영','25  CF',-0.29,0,0,2,0,8.52),(346,'배정대','25  CF',-0.34,0,0,26,2,154.32),(347,'김성욱','25  CF',-0.5,0,0,1,0,0),(348,'임병욱','25  CF',-0.51,0,0,18,1,103.08),(349,'박재현','25  CF',-0.68,0,0,3,0,9.84),(350,'최원준','25  CF',-0.98,0,0,24,0,132.24);
/*!40000 ALTER TABLE `batters_CF` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `batters_DH`
--

DROP TABLE IF EXISTS `batters_DH`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `batters_DH` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `pa` int DEFAULT NULL,
  `ab` int DEFAULT NULL,
  `hr` int DEFAULT NULL,
  `rbi` int DEFAULT NULL,
  `battingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=337 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `batters_DH`
--

LOCK TABLES `batters_DH` WRITE;
/*!40000 ALTER TABLE `batters_DH` DISABLE KEYS */;
INSERT INTO `batters_DH` VALUES (313,'최형우','25  DH',2.59,2,0,63,1,410.28),(314,'김현수','25  DH',1.51,1,0,55,0,348.12),(315,'문현빈','25  DH',1.35,1,0,63,0,394.2),(316,'김재환','25  DH',0.85,0,0,46,1,287.4),(317,'전준우','25  DH',0.67,1,0,59,1,363.24),(318,'최정','25  DH',0.56,0,0,18,0,114.72),(319,'강백호','25  DH',0.39,0,0,40,0,244.68),(320,'박병호','25  DH',0.15,0,0,25,0,151.8),(321,'박영빈','25  DH',0.06,0,0,0,0,0.72),(322,'여동건','25  DH',0.02,0,0,0,0,0.24),(323,'이창용','25  DH',0.01,0,0,3,0,18.12),(324,'김민혁','25  DH',0.01,0,0,1,0,6.12),(325,'홍대인','25  DH',-0.03,0,0,0,0,-0.36),(326,'한재환','25  DH',-0.04,0,0,5,0,29.52),(327,'이원석','25  DH',-0.04,0,0,1,0,5.52),(328,'김동준','25  DH',-0.05,0,0,0,0,-0.6),(329,'손용준','25  DH',-0.1,0,0,1,0,4.8),(330,'권광민','25  DH',-0.1,0,0,2,0,10.8),(331,'김동엽','25  DH',-0.13,0,0,0,0,-1.56),(332,'현원회','25  DH',-0.15,0,0,3,0,16.2),(333,'김웅빈','25  DH',-0.19,0,0,2,0,9.72),(334,'오영수','25  DH',-0.22,0,0,5,0,27.36),(335,'정훈','25  DH',-0.34,0,0,22,0,127.92),(336,'안치홍','25  DH',-1.09,0,0,6,0,22.92);
/*!40000 ALTER TABLE `batters_DH` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `batters_LF`
--

DROP TABLE IF EXISTS `batters_LF`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `batters_LF` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `pa` int DEFAULT NULL,
  `ab` int DEFAULT NULL,
  `hr` int DEFAULT NULL,
  `rbi` int DEFAULT NULL,
  `battingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=533 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `batters_LF`
--

LOCK TABLES `batters_LF` WRITE;
/*!40000 ALTER TABLE `batters_LF` DISABLE KEYS */;
INSERT INTO `batters_LF` VALUES (495,'권희동','25  LF',1.51,1,0,37,0,240.12),(496,'레이예스','25  LF',1.4,1,0,76,0,472.8),(497,'김인태','25  LF',0.82,0,0,20,0,129.84),(498,'박승규','25  LF',0.52,0,0,9,0,60.24),(499,'최원영','25  LF',0.44,0,0,5,0,35.28),(500,'최준우','25  LF',0.37,0,0,21,0,130.44),(501,'오선우','25  LF',0.35,0,0,37,0,226.2),(502,'에레디아','25  LF',0.35,0,0,15,0,94.2),(503,'구자욱','25  LF',0.33,0,0,51,0,309.96),(504,'김동혁','25  LF',0.3,0,0,3,0,21.6),(505,'채현우','25  LF',0.26,0,0,5,1,34.32),(506,'임지열','25  LF',0.24,0,0,10,0,62.88),(507,'함창건','25  LF',0.14,0,0,5,0,31.68),(508,'문성주','25  LF',0.08,0,0,36,0,216.96),(509,'안치영','25  LF',0.02,0,0,0,0,0.24),(510,'김태근','25  LF',-0.01,0,0,4,0,23.88),(511,'홍현빈','25  LF',-0.02,0,0,0,0,-0.24),(512,'함수호','25  LF',-0.03,0,0,0,0,-0.36),(513,'김범준','25  LF',-0.03,0,0,0,0,-0.36),(514,'권혁빈','25  LF',-0.03,0,0,0,0,-0.36),(515,'김병준','25  LF',-0.05,0,0,1,0,5.4),(516,'최승민','25  LF',-0.05,0,0,0,0,-0.6),(517,'박한결','25  LF',-0.07,0,0,2,0,11.16),(518,'추재현','25  LF',-0.07,0,0,14,1,84.36),(519,'오태곤','25  LF',-0.08,0,0,18,0,107.04),(520,'김건형','25  LF',-0.09,0,0,0,0,-1.08),(521,'김민혁','25  LF',-0.1,0,0,63,1,378),(522,'변상권','25  LF',-0.18,0,0,4,0,21.84),(523,'김석환','25  LF',-0.19,0,0,7,0,39.72),(524,'송승환','25  LF',-0.23,0,0,1,0,3.24),(525,'원성준','25  LF',-0.23,0,0,3,0,15.24),(526,'이우성','25  LF',-0.28,0,0,34,1,201.84),(527,'조수행','25  LF',-0.34,0,0,14,0,79.92),(528,'유준규','25  LF',-0.35,0,0,1,0,1.8),(529,'김태연','25  LF',-0.36,0,0,32,0,187.68),(530,'김민석','25  LF',-0.46,0,0,13,2,74.88),(531,'푸이그','25  LF',-0.46,0,0,33,0,192.48),(532,'최인호','25  LF',-0.47,0,0,14,0,78.36);
/*!40000 ALTER TABLE `batters_LF` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `batters_RF`
--

DROP TABLE IF EXISTS `batters_RF`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `batters_RF` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `pa` int DEFAULT NULL,
  `ab` int DEFAULT NULL,
  `hr` int DEFAULT NULL,
  `rbi` int DEFAULT NULL,
  `battingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=449 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `batters_RF`
--

LOCK TABLES `batters_RF` WRITE;
/*!40000 ALTER TABLE `batters_RF` DISABLE KEYS */;
INSERT INTO `batters_RF` VALUES (417,'안현민','25  RF',2.22,1,0,35,2,239.04),(418,'로하스','25  RF',1.76,1,0,55,0,351.12),(419,'이진영','25  RF',1.55,0,0,40,0,258.6),(420,'윤동희','25  RF',1.37,1,0,52,0,328.44),(421,'케이브','25  RF',1.32,0,0,58,1,365.04),(422,'손아섭','25  RF',1.01,0,0,48,3,303.72),(423,'홍창기','25  RF',0.78,0,0,36,0,225.36),(424,'한유섬','25  RF',0.57,0,0,46,0,282.84),(425,'이성규','25  RF',0.45,0,0,8,1,54.6),(426,'이원석','25  RF',0.38,0,0,7,0,46.56),(427,'송찬의','25  RF',0.22,0,0,27,1,165.84),(428,'박건우','25  RF',0.21,0,0,29,0,176.52),(429,'나성범','25  RF',0.16,0,0,21,0,127.92),(430,'정해원','25  RF',0.1,0,0,1,0,7.2),(431,'이형종','25  RF',0.02,0,0,11,0,66.24),(432,'김대한','25  RF',0.01,0,0,1,0,6.12),(433,'정현승','25  RF',0,0,0,1,0,6),(434,'김태훈','25  RF',-0.02,0,0,2,0,11.76),(435,'카디네스','25  RF',-0.03,0,0,45,1,270.84),(436,'김헌곤','25  RF',-0.07,0,0,29,0,173.16),(437,'최성민','25  RF',-0.1,0,0,1,0,4.8),(438,'박관우','25  RF',-0.1,0,0,0,0,-1.2),(439,'이민재','25  RF',-0.12,0,0,0,0,-1.44),(440,'맥브룸','25  RF',-0.14,0,0,15,0,88.32),(441,'박주홍','25  RF',-0.14,0,0,18,0,106.32),(442,'조세진','25  RF',-0.14,0,0,0,0,-1.68),(443,'최상민','25  RF',-0.15,0,0,1,0,4.2),(444,'임종찬','25  RF',-0.15,0,0,5,0,28.2),(445,'박시원','25  RF',-0.24,0,0,9,0,51.12),(446,'이상혁','25  RF',-0.3,0,0,2,0,8.4),(447,'하재훈','25  RF',-0.37,0,0,4,0,19.56),(448,'윤정빈','25  RF',-0.62,0,0,7,0,34.56);
/*!40000 ALTER TABLE `batters_RF` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `batters_SS`
--

DROP TABLE IF EXISTS `batters_SS`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `batters_SS` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `pa` int DEFAULT NULL,
  `ab` int DEFAULT NULL,
  `hr` int DEFAULT NULL,
  `rbi` int DEFAULT NULL,
  `battingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=295 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `batters_SS`
--

LOCK TABLES `batters_SS` WRITE;
/*!40000 ALTER TABLE `batters_SS` DISABLE KEYS */;
INSERT INTO `batters_SS` VALUES (274,'전민재','25  SS',1.9,2,0,55,0,352.8),(275,'이재현','25  SS',1.68,1,0,43,0,278.16),(276,'박찬호','25  SS',1.5,1,0,45,0,288),(277,'박성한','25  SS',1.4,0,0,39,0,250.8),(278,'김주원','25  SS',1.35,1,0,45,2,288.6),(279,'오지환','25  SS',1.33,0,0,38,0,243.96),(280,'하주석','25  SS',1.12,0,0,21,0,139.44),(281,'권동진','25  SS',0.64,0,0,29,1,182.88),(282,'이호준','25  SS',0.33,0,0,15,4,98.76),(283,'박민석','25  SS',0.23,0,0,4,1,27.96),(284,'박준영','25  SS',0.17,0,0,25,0,152.04),(285,'박민','25  SS',0.11,0,0,1,0,7.32),(286,'한태양','25  SS',0.07,0,0,5,0,30.84),(287,'장준원','25  SS',0.05,0,0,10,0,60.6),(288,'오선진','25  SS',-0.02,0,0,19,0,113.76),(289,'박승욱','25  SS',-0.08,0,0,3,0,17.04),(290,'이재상','25  SS',-0.1,0,0,1,0,4.8),(291,'박지훈','25  SS',-0.11,0,0,1,0,4.68),(292,'심우준','25  SS',-0.18,0,0,16,1,95.04),(293,'김태진','25  SS',-0.2,0,0,39,1,232.8),(294,'어준서','25  SS',-0.95,0,0,23,0,126.6);
/*!40000 ALTER TABLE `batters_SS` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `comments`
--

DROP TABLE IF EXISTS `comments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comments` (
  `id` int NOT NULL AUTO_INCREMENT,
  `post_id` int NOT NULL,
  `author` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `time` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `post_id` (`post_id`),
  CONSTRAINT `comments_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comments`
--

LOCK TABLES `comments` WRITE;
/*!40000 ALTER TABLE `comments` DISABLE KEYS */;
INSERT INTO `comments` VALUES (25,16,'yobro','adasd','2025-05-31 17:36:19'),(26,16,'yobro','asdads','2025-05-31 17:36:20'),(27,16,'yobro','adsasd','2025-05-31 17:36:21'),(28,16,'yobro','asdfasd','2025-05-31 19:53:42'),(29,16,'yobro','asdfasdf','2025-05-31 19:53:43'),(30,16,'yobro','asdfasdf','2025-05-31 19:53:43');
/*!40000 ALTER TABLE `comments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `fielders_1B`
--

DROP TABLE IF EXISTS `fielders_1B`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `fielders_1B` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `g` int DEFAULT NULL,
  `inn` float DEFAULT NULL,
  `dwar` float DEFAULT NULL,
  `err` int DEFAULT NULL,
  `assists` int DEFAULT NULL,
  `putouts` int DEFAULT NULL,
  `dp` int DEFAULT NULL,
  `fieldingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=701 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `fielders_1B`
--

LOCK TABLES `fielders_1B` WRITE;
/*!40000 ALTER TABLE `fielders_1B` DISABLE KEYS */;
INSERT INTO `fielders_1B` VALUES (651,'강승호','25  1B',0.172,10,2,29.2,35,31,4,0,-4.05),(652,'황재균','25  1B',0.146,27,21,184.2,186,168,18,0,7.5),(653,'정훈','25  1B',0.127,9,4,44.1,43,39,4,0,3.25),(654,'한재환','25  1B',0.123,6,2,21,24,23,1,0,-1.8),(655,'박민우','25  1B',0.118,2,1,11,13,13,0,0,-1.35),(656,'천성호','25  1B',0.118,5,1,13,18,17,1,0,-4.1),(657,'김규성','25  1B',0.102,3,2,17,19,17,2,0,-1.05),(658,'도태훈','25  1B',0.094,16,5,72,67,61,6,0,8.35),(659,'박병호','25  1B',0.086,11,10,68,55,46,8,1,15.7),(660,'김민수','25  1B',0.078,3,2,17,14,12,2,0,3.7),(661,'임지열','25  1B',0.074,4,2,20,25,25,0,0,-3.75),(662,'이영빈','25  1B',0.065,9,1,22,25,24,1,0,-1.75),(663,'이도윤','25  1B',0.048,4,0,5,7,7,0,0,-1.65),(664,'문보경','25  1B',0.038,9,1,22,19,19,0,0,3.95),(665,'박지훈','25  1B',0.035,8,0,12,6,6,0,0,6.3),(666,'윤준혁','25  1B',0.023,8,1,22,20,18,2,0,3),(667,'류지혁','25  1B',0.022,9,2,30,32,31,1,0,-0.4),(668,'추재현','25  1B',0.02,2,1,6.1,10,9,1,0,-3.4),(669,'윤정빈','25  1B',0.016,1,0,3,1,0,1,0,2.05),(670,'손용준','25  1B',0.005,1,1,4,6,6,0,0,-1.7),(671,'김태연','25  1B',-0.004,14,7,75,67,60,7,0,11.35),(672,'권광민','25  1B',-0.006,3,0,6.1,8,8,0,0,-1.5),(673,'황대인','25  1B',-0.011,6,6,53,50,49,1,0,5.5),(674,'박주홍','25  1B',-0.012,3,0,5,2,2,0,0,3.1),(675,'오선진','25  1B',-0.022,4,1,14,14,13,1,0,0.7),(676,'문정빈','25  1B',-0.028,6,2,18,20,18,2,0,-1),(677,'서건창','25  1B',-0.034,2,2,13,13,13,0,0,0.65),(678,'오영수','25  1B',-0.042,2,1,5,4,3,1,0,1.2),(679,'고명준','25  1B',-0.045,48,46,400.1,384,350,32,2,35.2),(680,'오선우','25  1B',-0.045,13,8,70,77,74,3,0,-3.15),(681,'송승환','25  1B',-0.055,1,1,2,2,2,0,0,0.1),(682,'맥브룸','25  1B',-0.064,6,5,45,48,43,5,0,-0.6),(683,'김현수','25  1B',-0.065,11,9,81,82,71,9,2,3),(684,'변우혁','25  1B',-0.071,14,4,52,44,39,5,0,10.2),(685,'강민성','25  1B',-0.078,2,0,6,0,0,0,0,6),(686,'강진성','25  1B',-0.082,4,2,19,18,17,1,0,1.9),(687,'김민성','25  1B',-0.082,6,1,12,15,15,0,0,-2.25),(688,'김인환','25  1B',-0.088,2,1,9,11,10,0,1,-1.5),(689,'송찬의','25  1B',-0.107,3,2,13,13,11,1,1,0.6),(690,'김웅빈','25  1B',-0.113,3,2,19,15,15,0,0,4.75),(691,'김휘집','25  1B',-0.117,10,6,59,50,46,4,0,11.5),(692,'문상철','25  1B',-0.118,38,33,274,272,250,22,0,15.6),(693,'오태곤','25  1B',-0.124,15,5,58.1,57,54,3,0,3.95),(694,'서호철','25  1B',-0.141,19,14,119,105,103,2,0,19.25),(695,'위즈덤','25  1B',-0.145,35,33,278,297,281,16,0,-4.15),(696,'전병우','25  1B',-0.166,3,0,5,6,5,0,1,-0.75),(697,'이창용','25  1B',-0.175,3,1,10,13,12,0,1,-2.4),(698,'양석환','25  1B',-0.177,54,54,453.2,438,399,35,4,36.9),(699,'오윤석','25  1B',-0.185,8,2,21.1,14,14,0,0,7.8),(700,'카디네스','25  1B',-0.191,6,6,54,49,42,5,2,7.35);
/*!40000 ALTER TABLE `fielders_1B` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `fielders_2B`
--

DROP TABLE IF EXISTS `fielders_2B`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `fielders_2B` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `g` int DEFAULT NULL,
  `inn` float DEFAULT NULL,
  `dwar` float DEFAULT NULL,
  `err` int DEFAULT NULL,
  `assists` int DEFAULT NULL,
  `putouts` int DEFAULT NULL,
  `dp` int DEFAULT NULL,
  `fieldingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=701 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `fielders_2B`
--

LOCK TABLES `fielders_2B` WRITE;
/*!40000 ALTER TABLE `fielders_2B` DISABLE KEYS */;
INSERT INTO `fielders_2B` VALUES (651,'박민우','25  2B',0.515,42,39,311,188,76,108,4,132.2),(652,'천성호','25  2B',0.414,20,14,119.1,77,25,50,2,45.85),(653,'강승호','25  2B',0.391,24,23,191.1,114,61,52,1,82.75),(654,'전태현','25  2B',0.271,15,8,78,41,16,25,0,39.05),(655,'홍종표','25  2B',0.255,18,8,87,56,24,32,0,33.8),(656,'김규성','25  2B',0.195,22,7,90,45,19,26,0,47.25),(657,'송성문','25  2B',0.145,24,23,187,118,54,63,1,74.85),(658,'이유찬','25  2B',0.138,6,4,40,26,12,14,0,15.3),(659,'류지혁','25  2B',0.136,46,37,327,168,78,90,0,167.4),(660,'양도근','25  2B',0.135,18,7,74,42,15,27,0,34.1),(661,'신민재','25  2B',0.113,47,34,308.1,175,76,98,1,141.8),(662,'최정용','25  2B',0.11,3,2,17,10,4,6,0,7.5),(663,'서건창','25  2B',0.109,7,4,34,23,11,12,0,12.15),(664,'박승욱','25  2B',0.106,7,0,10,8,1,7,0,2.4),(665,'전병우','25  2B',0.102,5,3,16,11,7,4,0,5.55),(666,'박민','25  2B',0.1,1,0,7,7,3,4,0,0.35),(667,'도태훈','25  2B',0.089,8,4,38,25,7,17,1,14.2),(668,'송지후','25  2B',0.07,7,7,52,30,17,12,1,23.45),(669,'김민성','25  2B',0.059,12,10,81,39,17,22,0,43.95),(670,'오윤석','25  2B',0.045,19,12,114.2,69,29,39,1,48.6),(671,'장준원','25  2B',0.038,3,2,17.1,11,4,7,0,6.65),(672,'김성현','25  2B',0.037,12,7,61.2,41,17,23,1,22.2),(673,'김찬형','25  2B',0.036,5,3,21.2,7,3,4,0,14.55),(674,'박계범','25  2B',0.035,15,11,100,49,25,24,0,53.45),(675,'이호준','25  2B',0.034,20,1,39.1,20,5,15,0,20.1),(676,'정준재','25  2B',0.03,50,42,391.1,236,102,129,5,166.65),(677,'전민재','25  2B',0.026,4,2,19,11,7,4,0,8.55),(678,'김상수','25  2B',0.022,24,22,183,101,36,65,0,87.05),(679,'김한별','25  2B',0.021,8,3,29.2,16,4,12,0,14),(680,'김준상','25  2B',0.004,3,1,13,5,2,3,0,8.25),(681,'이도윤','25  2B',0.004,23,13,121.2,56,22,34,0,68),(682,'오명진','25  2B',0.003,22,16,136,73,35,37,1,66.6),(683,'최항','25  2B',0,1,0,1,1,1,0,0,0.05),(684,'박준순','25  2B',-0.008,7,2,23,14,5,8,1,9.65),(685,'구본혁','25  2B',-0.008,23,18,148,81,35,45,1,71),(686,'박민석','25  2B',-0.02,3,1,9,4,2,2,0,5.2),(687,'한태양','25  2B',-0.02,9,0,13.1,7,5,2,0,6.45),(688,'김주성','25  2B',-0.026,2,0,3,0,0,0,0,3),(689,'권동진','25  2B',-0.027,4,2,24,13,4,9,0,11.65),(690,'김태진','25  2B',-0.031,27,18,175,101,37,63,1,79),(691,'이영빈','25  2B',-0.031,12,5,48,32,11,21,0,17.6),(692,'서유신','25  2B',-0.038,1,1,8,3,1,2,0,5.15),(693,'심재훈','25  2B',-0.043,12,6,64,25,10,15,0,40.25),(694,'고승민','25  2B',-0.046,46,45,352,201,69,128,4,160.85),(695,'안상현','25  2B',-0.051,3,3,24,12,3,9,0,12.6),(696,'김선빈','25  2B',-0.053,29,28,210,104,44,57,3,111.05),(697,'오선진','25  2B',-0.058,4,3,23,14,8,5,1,9.65),(698,'최정원','25  2B',-0.085,10,4,48,30,13,17,0,19.5),(699,'안치홍','25  2B',-0.091,5,5,35,21,5,15,1,15),(700,'석정우','25  2B',-0.116,1,1,4,3,0,2,1,1.1);
/*!40000 ALTER TABLE `fielders_2B` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `fielders_3B`
--

DROP TABLE IF EXISTS `fielders_3B`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `fielders_3B` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `g` int DEFAULT NULL,
  `inn` float DEFAULT NULL,
  `dwar` float DEFAULT NULL,
  `err` int DEFAULT NULL,
  `assists` int DEFAULT NULL,
  `putouts` int DEFAULT NULL,
  `dp` int DEFAULT NULL,
  `fieldingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=701 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `fielders_3B`
--

LOCK TABLES `fielders_3B` WRITE;
/*!40000 ALTER TABLE `fielders_3B` DISABLE KEYS */;
INSERT INTO `fielders_3B` VALUES (651,'송성문','25  3B',0.46,34,32,278,109,40,66,3,174.3),(652,'김영웅','25  3B',0.333,43,41,353,99,28,66,5,258.7),(653,'서호철','25  3B',0.331,13,9,82,25,8,15,2,58.15),(654,'김도영','25  3B',0.295,22,22,180,51,9,39,3,131.4),(655,'오선진','25  3B',0.283,15,6,67,17,3,14,0,50.85),(656,'허경민','25  3B',0.281,34,33,288.1,84,29,51,4,208.1),(657,'임종성','25  3B',0.23,22,18,149,41,15,24,2,109.95),(658,'변우혁','25  3B',0.222,29,24,213,69,17,48,4,147.25),(659,'전병우','25  3B',0.197,18,7,69,19,4,15,0,50.95),(660,'김찬형','25  3B',0.163,8,4,40,14,4,9,1,26.65),(661,'김민성','25  3B',0.158,20,13,111.1,20,1,19,0,92.1),(662,'강승호','25  3B',0.127,30,29,244,82,24,53,5,165.85),(663,'이영빈','25  3B',0.104,5,2,25,3,1,2,0,22.15),(664,'오명진','25  3B',0.103,7,7,57,13,4,9,0,44.65),(665,'강민성','25  3B',0.09,5,0,7,5,2,3,0,2.25),(666,'구본혁','25  3B',0.087,22,11,98.1,21,6,15,0,78.15),(667,'문정빈','25  3B',0.076,5,0,13,1,0,1,0,12.05),(668,'여동건','25  3B',0.058,1,0,2,1,0,1,0,1.05),(669,'위즈덤','25  3B',0.058,1,1,6,3,0,3,0,3.15),(670,'송지후','25  3B',0.056,1,0,3,1,0,1,0,2.05),(671,'노시환','25  3B',0.05,56,56,499,131,37,87,7,374.2),(672,'이도윤','25  3B',0.036,2,1,10,2,2,0,0,8.1),(673,'양현종','25  3B',0.025,3,2,13,2,0,2,0,11.1),(674,'양도근','25  3B',0.022,5,1,15,7,2,4,1,8.3),(675,'박준영','25  3B',0.011,2,0,2.1,1,1,0,0,1.15),(676,'정현창','25  3B',0.003,1,1,8,0,0,0,0,8),(677,'이재상','25  3B',0,1,0,2,0,0,0,0,2),(678,'한재환','25  3B',0,1,0,2.1,0,0,0,0,2.1),(679,'박민','25  3B',-0.006,1,1,8,5,0,5,0,3.25),(680,'홍종표','25  3B',-0.022,5,3,26,9,4,5,0,17.45),(681,'윤도현','25  3B',-0.049,2,1,12,5,2,3,0,7.25),(682,'장준원','25  3B',-0.049,2,0,6,1,1,0,0,5.05),(683,'김한별','25  3B',-0.058,8,2,24,5,4,1,0,19.25),(684,'한태양','25  3B',-0.063,4,0,7,0,0,0,0,7),(685,'김성현','25  3B',-0.069,18,8,90,25,3,20,2,66.15),(686,'도태훈','25  3B',-0.08,6,1,22,4,1,2,1,18.15),(687,'이승원','25  3B',-0.083,1,1,5,1,0,0,1,4),(688,'최정','25  3B',-0.087,2,2,18,3,0,2,1,15.1),(689,'박계범','25  3B',-0.094,12,3,43.2,11,2,8,1,32.7),(690,'김수윤','25  3B',-0.097,7,5,35,14,4,8,2,21.6),(691,'송찬의','25  3B',-0.101,3,0,6,0,0,0,0,6),(692,'전태현','25  3B',-0.102,13,9,80,19,5,13,1,61.9),(693,'류지혁','25  3B',-0.104,11,8,70,15,4,10,1,55.7),(694,'여동욱','25  3B',-0.105,9,5,41,13,6,5,2,28.55),(695,'석정우','25  3B',-0.11,4,3,20,3,0,2,1,17.1),(696,'손호영','25  3B',-0.116,41,40,349.1,112,32,72,8,242.3),(697,'김규성','25  3B',-0.127,9,3,38,10,3,7,0,28.5),(698,'고영우','25  3B',-0.149,2,1,9,2,1,0,1,7.05),(699,'문보경','25  3B',-0.212,45,44,365,96,25,64,7,273.45),(700,'황재균','25  3B',-0.223,28,25,219.2,35,18,16,1,185.9);
/*!40000 ALTER TABLE `fielders_3B` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `fielders_C`
--

DROP TABLE IF EXISTS `fielders_C`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `fielders_C` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `g` int DEFAULT NULL,
  `inn` float DEFAULT NULL,
  `dwar` float DEFAULT NULL,
  `err` int DEFAULT NULL,
  `assists` int DEFAULT NULL,
  `putouts` int DEFAULT NULL,
  `dp` int DEFAULT NULL,
  `fieldingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=483 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `fielders_C`
--

LOCK TABLES `fielders_C` WRITE;
/*!40000 ALTER TABLE `fielders_C` DISABLE KEYS */;
INSERT INTO `fielders_C` VALUES (448,'이재원','25  C',0.519,50,17,208,222,201,20,1,-2.95),(449,'장성우','25  C',0.517,52,48,401.2,383,358,23,2,37.25),(450,'강민호','25  C',0.516,52,43,392.1,353,330,22,1,56.7),(451,'양의지','25  C',0.504,40,40,315.1,284,263,19,2,45.2),(452,'박동원','25  C',0.474,54,45,401.1,379,352,25,2,40.95),(453,'김태군','25  C',0.469,33,27,228.1,212,184,25,3,26.55),(454,'조형우','25  C',0.372,37,30,260.2,249,229,19,1,23.6),(455,'유강남','25  C',0.288,42,40,269.2,269,252,16,1,13.6),(456,'김건희','25  C',0.285,27,21,187,149,131,17,1,45.4),(457,'김형준','25  C',0.284,40,35,296,260,241,17,2,48.9),(458,'정보근','25  C',0.186,47,17,221.1,221,206,13,2,11.05),(459,'이지영','25  C',0.186,26,21,189.2,201,189,11,1,-1.8),(460,'이병헌','25  C',0.155,20,9,77.2,69,65,3,1,11.6),(461,'한승택','25  C',0.136,10,5,50,42,34,8,0,10.1),(462,'한준수','25  C',0.114,33,23,204.2,211,193,16,2,3.65),(463,'이주헌','25  C',0.091,23,12,99,104,99,5,0,0.2),(464,'김재성','25  C',0.088,10,5,37,37,34,3,0,1.85),(465,'김동헌','25  C',0.087,22,9,96,87,82,4,1,13.3),(466,'신범수','25  C',0.079,15,5,53.1,48,46,2,0,7.5),(467,'조대현','25  C',0.076,17,3,45.1,41,37,4,0,6.15),(468,'최재훈','25  C',0.071,46,40,301,336,310,24,2,-18.3),(469,'김기연','25  C',0.063,33,16,175,153,143,8,2,29.55),(470,'손성빈','25  C',0.055,8,1,20.2,10,9,1,0,10.7),(471,'김재현','25  C',0.039,43,30,242,209,188,18,3,43.3),(472,'김정호','25  C',0.035,2,0,9,4,4,0,0,5.2),(473,'안중열','25  C',0.012,7,4,34.1,24,20,3,1,11.25),(474,'김성우','25  C',0,3,0,7,6,6,0,0,1.3),(475,'강백호','25  C',-0.003,5,4,32.2,25,22,2,1,8.4),(476,'장승현','25  C',-0.008,4,1,11,11,10,1,0,0.55),(477,'박세혁','25  C',-0.058,26,14,116,109,97,9,3,12.3),(478,'박재엽','25  C',-0.059,2,0,4,5,4,0,1,-0.8),(479,'류현준','25  C',-0.08,2,0,3,5,5,0,0,-1.75),(480,'강현우','25  C',-0.128,10,3,41.1,39,33,4,2,3.95),(481,'박민준','25  C',0,1,0,1,0,0,0,0,1),(482,'허인서','25  C',0,1,0,1,1,1,0,0,0.05);
/*!40000 ALTER TABLE `fielders_C` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `fielders_CF`
--

DROP TABLE IF EXISTS `fielders_CF`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `fielders_CF` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `g` int DEFAULT NULL,
  `inn` float DEFAULT NULL,
  `dwar` float DEFAULT NULL,
  `err` int DEFAULT NULL,
  `assists` int DEFAULT NULL,
  `putouts` int DEFAULT NULL,
  `dp` int DEFAULT NULL,
  `fieldingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=701 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `fielders_CF`
--

LOCK TABLES `fielders_CF` WRITE;
/*!40000 ALTER TABLE `fielders_CF` DISABLE KEYS */;
INSERT INTO `fielders_CF` VALUES (651,'박해민','25  CF',0.521,57,52,455.1,116,114,2,0,344.9),(652,'이주형','25  CF',0.452,40,38,322,112,111,1,0,215.6),(653,'장두성','25  CF',0.382,35,19,213,67,66,1,0,149.35),(654,'김성윤','25  CF',0.337,43,35,328,96,95,1,0,236.8),(655,'정수빈','25  CF',0.324,55,55,454.1,102,102,0,0,357.2),(656,'최원영','25  CF',0.289,15,2,32,13,13,0,0,19.65),(657,'플로리얼','25  CF',0.278,56,55,477,131,125,3,3,352.4),(658,'천재환','25  CF',0.204,28,17,161.2,48,48,0,0,115.6),(659,'박주홍','25  CF',0.19,6,4,35,21,20,1,0,15.05),(660,'배정대','25  CF',0.168,52,37,357.1,86,84,1,1,275.35),(661,'채현우','25  CF',0.165,4,2,18,6,6,0,0,12.3),(662,'로하스','25  CF',0.104,5,5,34,7,7,0,0,27.35),(663,'유준규','25  CF',0.102,7,1,23.2,7,6,1,0,16.55),(664,'한석현','25  CF',0.099,21,16,147,39,38,1,0,109.95),(665,'안현민','25  CF',0.078,12,10,72.2,15,15,0,0,57.95),(666,'박영빈','25  CF',0.063,3,0,5,2,2,0,0,3.1),(667,'김동혁','25  CF',0.063,3,1,19,8,8,0,0,11.4),(668,'이진영','25  CF',0.015,1,1,3,1,1,0,0,2.05),(669,'신민재','25  CF',0.001,2,1,6,0,0,0,0,6),(670,'양도근','25  CF',0,2,0,3,0,0,0,0,3),(671,'원성준','25  CF',-0.009,1,0,2,0,0,0,0,2),(672,'김대한','25  CF',-0.009,1,0,3,0,0,0,0,3),(673,'김병준','25  CF',-0.011,1,0,3,0,0,0,0,3),(674,'송찬의','25  CF',-0.028,3,2,14,2,2,0,0,12.1),(675,'전다민','25  CF',-0.042,4,0,12,5,4,0,1,7.2),(676,'최정원','25  CF',-0.046,6,2,20,5,5,0,0,15.25),(677,'최성민','25  CF',-0.048,3,1,5.1,2,1,0,1,3.15),(678,'오태곤','25  CF',-0.059,5,2,20,3,3,0,0,17.15),(679,'박수종','25  CF',-0.063,7,2,27,10,10,0,0,17.5),(680,'장진혁','25  CF',-0.063,5,3,24,6,6,0,0,18.3),(681,'조수행','25  CF',-0.063,12,2,33,11,10,0,1,22.5),(682,'이용규','25  CF',-0.083,7,7,52,18,17,0,1,34.85),(683,'김호령','25  CF',-0.086,18,12,127,30,28,0,2,98.4),(684,'윤동희','25  CF',-0.091,12,11,74,23,23,0,0,52.15),(685,'장재영','25  CF',-0.101,6,2,24,11,10,0,1,13.5),(686,'권희동','25  CF',-0.103,3,2,13,3,3,0,0,10.15),(687,'박건우','25  CF',-0.112,7,7,51,14,13,0,1,37.65),(688,'김민혁','25  CF',-0.113,1,1,1,0,0,0,0,1),(689,'박정우','25  CF',-0.136,16,12,82,16,16,0,0,66.8),(690,'임병욱','25  CF',-0.136,13,7,63,22,22,0,0,42.1),(691,'김재혁','25  CF',-0.15,5,0,8,2,2,0,0,6.1),(692,'최지훈','25  CF',-0.17,54,52,460.2,97,94,0,3,367.9),(693,'이우성','25  CF',-0.178,3,1,12,4,4,0,0,8.2),(694,'박시원','25  CF',-0.2,6,5,31,8,8,0,0,23.4),(695,'문현빈','25  CF',-0.215,4,1,14,4,3,1,0,10.2),(696,'황성빈','25  CF',-0.252,27,27,209.2,43,40,1,2,168.25),(697,'김성욱','25  CF',-0.255,5,4,26.2,8,8,0,0,18.6),(698,'박재현','25  CF',-0.257,15,5,61,11,9,1,1,50.5),(699,'김지찬','25  CF',-0.354,23,22,166,46,46,0,0,122.3),(700,'최원준','25  CF',-0.472,26,25,201,47,44,2,1,156.3);
/*!40000 ALTER TABLE `fielders_CF` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `fielders_LF`
--

DROP TABLE IF EXISTS `fielders_LF`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `fielders_LF` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `g` int DEFAULT NULL,
  `inn` float DEFAULT NULL,
  `dwar` float DEFAULT NULL,
  `err` int DEFAULT NULL,
  `assists` int DEFAULT NULL,
  `putouts` int DEFAULT NULL,
  `dp` int DEFAULT NULL,
  `fieldingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=701 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `fielders_LF`
--

LOCK TABLES `fielders_LF` WRITE;
/*!40000 ALTER TABLE `fielders_LF` DISABLE KEYS */;
INSERT INTO `fielders_LF` VALUES (651,'문성주','25  LF',0.318,21,16,144,41,41,0,0,105.05),(652,'한유섬','25  LF',0.223,6,6,44,10,10,0,0,34.5),(653,'이원석','25  LF',0.211,18,1,47.1,15,14,0,1,32.8),(654,'이진영','25  LF',0.205,7,5,52,15,14,1,0,37.75),(655,'함창건','25  LF',0.203,7,5,41,14,14,0,0,27.7),(656,'임병욱','25  LF',0.166,8,6,56,13,13,0,0,43.65),(657,'김헌곤','25  LF',0.153,19,7,71,17,17,0,0,54.85),(658,'김재환','25  LF',0.139,15,13,103.2,23,22,1,0,81.35),(659,'최성민','25  LF',0.138,5,1,8.1,5,4,1,0,3.35),(660,'송찬의','25  LF',0.125,18,12,107,27,26,1,0,81.35),(661,'천재환','25  LF',0.114,20,4,67.1,19,18,0,1,49),(662,'박정우','25  LF',0.092,18,1,37,9,9,0,0,28.45),(663,'장진혁','25  LF',0.09,6,0,6.1,5,4,1,0,1.35),(664,'임지열','25  LF',0.074,5,5,36,10,10,0,0,26.5),(665,'로하스','25  LF',0.07,19,8,86,19,18,1,0,67.95),(666,'레이예스','25  LF',0.067,38,31,271.1,51,51,0,0,222.65),(667,'박시원','25  LF',0.066,2,1,12,6,6,0,0,6.3),(668,'한석현','25  LF',0.05,5,2,20.1,1,1,0,0,19.15),(669,'최원영','25  LF',0.044,19,1,34,8,8,0,0,26.4),(670,'추재현','25  LF',0.043,8,7,66,15,15,0,0,51.75),(671,'이유찬','25  LF',0.032,2,2,13,3,3,0,0,10.15),(672,'최정원','25  LF',0.027,2,1,12,4,4,0,0,8.2),(673,'이성규','25  LF',0.021,1,1,9,2,2,0,0,7.1),(674,'플로리얼','25  LF',0.019,2,1,11,4,3,1,0,7.2),(675,'김병준','25  LF',0.019,3,0,5.1,1,1,0,0,4.15),(676,'권혁빈','25  LF',0.017,1,0,2,2,2,0,0,0.1),(677,'박주홍','25  LF',0.016,18,8,82,31,30,1,0,52.55),(678,'김동혁','25  LF',0.016,14,0,16,6,6,0,0,10.3),(679,'김현수','25  LF',0.015,23,22,176.1,34,34,0,0,143.8),(680,'최승민','25  LF',0.008,1,0,2,1,1,0,0,1.05),(681,'최상민','25  LF',0.006,2,0,4,0,0,0,0,4),(682,'에레디아','25  LF',0.006,12,12,110,32,30,1,1,79.55),(683,'김인태','25  LF',0.005,16,13,97,22,22,0,0,76.1),(684,'손아섭','25  LF',0.004,1,1,2,1,1,0,0,1.05),(685,'이상혁','25  LF',0,3,0,5,0,0,0,0,5),(686,'최원준','25  LF',-0.001,2,0,4,0,0,0,0,4),(687,'고승민','25  LF',-0.001,1,0,2,0,0,0,0,2),(688,'전태현','25  LF',-0.001,1,0,1,0,0,0,0,1),(689,'장두성','25  LF',-0.002,3,0,6,0,0,0,0,6),(690,'박수종','25  LF',-0.009,1,0,2,1,1,0,0,1.05),(691,'채현우','25  LF',-0.015,7,5,40,10,9,0,1,30.45),(692,'최형우','25  LF',-0.017,4,4,27,4,4,0,0,23.2),(693,'전다민','25  LF',-0.02,3,0,9,0,0,0,0,9),(694,'김성윤','25  LF',-0.022,1,0,1,0,0,0,0,1),(695,'변상권','25  LF',-0.022,3,2,15,5,5,0,0,10.25),(696,'원성준','25  LF',-0.024,4,3,31,8,8,0,0,23.4),(697,'한재환','25  LF',-0.028,3,1,9,2,2,0,0,7.1),(698,'장재영','25  LF',-0.03,3,0,5,0,0,0,0,5),(699,'문정빈','25  LF',-0.044,1,1,3,0,0,0,0,3),(700,'조수행','25  LF',-0.051,24,9,109.2,31,31,0,0,79.75);
/*!40000 ALTER TABLE `fielders_LF` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `fielders_RF`
--

DROP TABLE IF EXISTS `fielders_RF`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `fielders_RF` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `g` int DEFAULT NULL,
  `inn` float DEFAULT NULL,
  `dwar` float DEFAULT NULL,
  `err` int DEFAULT NULL,
  `assists` int DEFAULT NULL,
  `putouts` int DEFAULT NULL,
  `dp` int DEFAULT NULL,
  `fieldingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=701 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `fielders_RF`
--

LOCK TABLES `fielders_RF` WRITE;
/*!40000 ALTER TABLE `fielders_RF` DISABLE KEYS */;
INSERT INTO `fielders_RF` VALUES (651,'김태연','25  RF',0.296,10,5,47.2,14,13,1,0,33.9),(652,'정해원','25  RF',0.283,7,6,39.1,13,13,0,0,26.75),(653,'이진영','25  RF',0.271,39,37,282,51,50,1,0,233.55),(654,'윤동희','25  RF',0.261,43,35,326.1,84,81,1,2,246.2),(655,'이형종','25  RF',0.235,12,6,63.1,17,16,1,0,46.95),(656,'안현민','25  RF',0.235,21,14,128.1,35,30,5,0,94.85),(657,'이성규','25  RF',0.233,19,12,110,29,27,1,1,82.4),(658,'케이브','25  RF',0.183,48,48,407.1,95,92,2,1,316.8),(659,'장두성','25  RF',0.164,9,6,57,17,16,0,1,40.8),(660,'이원석','25  RF',0.143,21,4,74.1,17,16,1,0,57.95),(661,'오태곤','25  RF',0.132,10,6,52.1,13,12,1,0,39.75),(662,'김성윤','25  RF',0.131,14,11,82,21,21,0,0,62.05),(663,'한석현','25  RF',0.107,3,1,12.1,4,3,1,0,8.3),(664,'채현우','25  RF',0.104,6,1,21,4,4,0,0,17.2),(665,'맥브룸','25  RF',0.071,10,10,72,15,15,0,0,57.75),(666,'송찬의','25  RF',0.068,17,14,121,25,25,0,0,97.25),(667,'박승규','25  RF',0.063,5,3,29,5,5,0,0,24.25),(668,'박정우','25  RF',0.061,7,1,22.2,5,5,0,0,17.45),(669,'최성민','25  RF',0.059,14,2,41.1,7,7,0,0,34.45),(670,'안치영','25  RF',0.058,3,0,8,2,2,0,0,6.1),(671,'손아섭','25  RF',0.053,30,29,210,43,43,0,0,169.15),(672,'이유찬','25  RF',0.052,1,1,8,2,2,0,0,6.1),(673,'김성욱','25  RF',0.051,2,0,3.1,1,1,0,0,2.15),(674,'함창건','25  RF',0.048,6,0,12,3,3,0,0,9.15),(675,'최원영','25  RF',0.042,9,0,12.1,4,4,0,0,8.3),(676,'레이예스','25  RF',0.01,16,16,121.1,26,25,0,1,96.35),(677,'이민재','25  RF',0,1,1,5,1,1,0,0,4.05),(678,'전다민','25  RF',-0.001,1,0,2,0,0,0,0,2),(679,'이영빈','25  RF',-0.001,1,0,1,0,0,0,0,1),(680,'변상권','25  RF',-0.002,2,0,1.2,0,0,0,0,1.2),(681,'문정빈','25  RF',-0.009,2,1,8,0,0,0,0,8),(682,'정현승','25  RF',-0.021,1,0,4.2,0,0,0,0,4.2),(683,'이우성','25  RF',-0.022,13,8,85.2,11,11,0,0,74.75),(684,'장진혁','25  RF',-0.035,6,0,11,3,3,0,0,8.15),(685,'김태근','25  RF',-0.035,3,1,11,3,3,0,0,8.15),(686,'권희동','25  RF',-0.038,3,2,7,0,0,0,0,7),(687,'조세진','25  RF',-0.042,3,1,3,0,0,0,0,3),(688,'최상민','25  RF',-0.062,14,0,23.2,6,6,0,0,17.5),(689,'임종찬','25  RF',-0.066,13,10,86.1,17,16,0,1,69.9),(690,'박관우','25  RF',-0.077,1,0,2,1,0,0,1,1),(691,'장재영','25  RF',-0.085,2,1,10,0,0,0,0,10),(692,'이상혁','25  RF',-0.086,5,0,12.2,2,2,0,0,10.3),(693,'김인태','25  RF',-0.088,5,0,6,2,2,0,0,4.1),(694,'김태훈','25  RF',-0.095,1,1,6,0,0,0,0,6),(695,'원성준','25  RF',-0.098,4,1,11,2,2,0,0,9.1),(696,'유준규','25  RF',-0.098,2,2,12,2,2,0,0,10.1),(697,'천재환','25  RF',-0.1,14,4,51,7,6,1,0,44.35),(698,'문성주','25  RF',-0.113,7,6,53.1,12,11,0,1,41.65),(699,'최준우','25  RF',-0.118,3,2,15,5,5,0,0,10.25),(700,'조수행','25  RF',-0.125,10,3,38,12,12,0,0,26.6);
/*!40000 ALTER TABLE `fielders_RF` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `fielders_SS`
--

DROP TABLE IF EXISTS `fielders_SS`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `fielders_SS` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `g` int DEFAULT NULL,
  `inn` float DEFAULT NULL,
  `dwar` float DEFAULT NULL,
  `err` int DEFAULT NULL,
  `assists` int DEFAULT NULL,
  `putouts` int DEFAULT NULL,
  `dp` int DEFAULT NULL,
  `fieldingScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=629 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `fielders_SS`
--

LOCK TABLES `fielders_SS` WRITE;
/*!40000 ALTER TABLE `fielders_SS` DISABLE KEYS */;
INSERT INTO `fielders_SS` VALUES (583,'박성한','25  SS',0.858,54,52,457.2,261,103,149,9,208.8),(584,'오지환','25  SS',0.789,54,44,387.1,180,58,119,3,215.95),(585,'하주석','25  SS',0.746,21,18,160.2,68,20,48,0,95.6),(586,'김주원','25  SS',0.718,53,52,427,237,98,128,11,201.3),(587,'박찬호','25  SS',0.671,46,45,374,197,76,117,4,186.65),(588,'이재현','25  SS',0.668,54,54,451,214,83,123,8,247.3),(589,'심우준','25  SS',0.374,33,32,261.1,141,50,88,3,127),(590,'전민재','25  SS',0.36,35,32,275.1,123,49,68,6,157.95),(591,'김규성','25  SS',0.31,17,9,96,52,14,35,3,46.45),(592,'장준원','25  SS',0.256,13,11,94.1,41,18,23,0,55.15),(593,'오명진','25  SS',0.231,16,15,128.1,69,28,39,2,62.45),(594,'권동진','25  SS',0.15,42,33,287,159,62,89,8,135.55),(595,'이도윤','25  SS',0.147,15,7,86,36,12,22,2,51.7),(596,'김성현','25  SS',0.125,4,2,19,10,2,8,0,9.5),(597,'구본혁','25  SS',0.106,21,13,117,54,15,38,1,65.65),(598,'박민석','25  SS',0.072,7,3,33.1,15,6,8,1,18.8),(599,'윤준혁','25  SS',0.061,3,0,10,3,0,3,0,7.15),(600,'박계범','25  SS',0.061,11,5,52,21,8,13,0,32.05),(601,'황재균','25  SS',0.021,1,0,1,1,0,1,0,0.05),(602,'안주형','25  SS',0.013,3,0,6,4,1,3,0,2.2),(603,'박준영','25  SS',0.003,38,34,287,137,54,75,8,156.45),(604,'김준상','25  SS',0.002,1,0,1,0,0,0,0,1),(605,'양도근','25  SS',0.001,14,3,50,25,12,12,1,26.2),(606,'김도영','25  SS',-0.001,1,0,2,0,0,0,0,2),(607,'김한별','25  SS',-0.03,6,1,20,11,4,6,1,9.5),(608,'송지후','25  SS',-0.032,1,0,2,1,1,0,0,1.05),(609,'이유찬','25  SS',-0.048,3,2,17,5,4,1,0,12.25),(610,'전태현','25  SS',-0.056,3,0,5,2,1,1,0,3.1),(611,'박지훈','25  SS',-0.057,5,1,18,8,2,5,1,10.35),(612,'박승욱','25  SS',-0.074,11,7,58,31,11,18,2,28.45),(613,'김찬형','25  SS',-0.077,4,0,5,6,2,3,1,-0.75),(614,'이영빈','25  SS',-0.083,2,0,3,0,0,0,0,3),(615,'윤도현','25  SS',-0.085,1,1,9,4,1,2,1,5.15),(616,'도태훈','25  SS',-0.089,2,0,8.1,5,2,2,1,3.3),(617,'이호준','25  SS',-0.104,27,18,168.1,67,18,44,5,104.2),(618,'한태양','25  SS',-0.122,5,1,14,12,5,6,1,2.55),(619,'이재상','25  SS',-0.128,1,1,2,1,0,0,1,1),(620,'김상수','25  SS',-0.138,13,11,95.1,48,22,24,2,49.4),(621,'김태진','25  SS',-0.158,32,23,210,87,26,55,6,127.05),(622,'안상현','25  SS',-0.18,6,2,22,4,3,1,0,18.2),(623,'오선진','25  SS',-0.374,26,12,121,51,24,25,2,72.45),(624,'어준서','25  SS',-0.377,34,24,185,90,36,45,9,99.05),(625,'박민','25  SS',0,1,0,1,0,0,0,0,1),(626,'박준순','25  SS',0,2,0,2,1,1,0,0,1.05),(627,'홍종표','25  SS',0,1,0,1,1,0,1,0,0.05),(628,'이승현','25  SS',0,2,0,2,2,2,0,0,0.1);
/*!40000 ALTER TABLE `fielders_SS` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `pitchers`
--

DROP TABLE IF EXISTS `pitchers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `pitchers` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `team` varchar(20) DEFAULT NULL,
  `war` float DEFAULT NULL,
  `g` int DEFAULT NULL,
  `w` int DEFAULT NULL,
  `l` int DEFAULT NULL,
  `era` float DEFAULT NULL,
  `ip` float DEFAULT NULL,
  `so` int DEFAULT NULL,
  `sv` int DEFAULT NULL,
  `hld` int DEFAULT NULL,
  `pitcherScore` float DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=351 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `pitchers`
--

LOCK TABLES `pitchers` WRITE;
/*!40000 ALTER TABLE `pitchers` DISABLE KEYS */;
INSERT INTO `pitchers` VALUES (301,'폰세','25  P',3.8,12,12,0,0,0,0,8,0,74),(302,'후라도','25  P',3.51,12,12,0,1,1,0,5,4,71.6),(303,'임찬규','25  P',3.15,11,11,0,1,1,1,8,1,66),(304,'네일','25  P',3.11,12,12,0,0,0,0,3,1,61.1),(305,'데이비슨','25  P',3.1,12,12,0,0,0,0,6,1,65.5),(306,'원태인','25  P',2.87,11,11,0,0,0,0,4,2,59.7),(307,'앤더슨','25  P',2.71,11,11,0,0,0,0,4,2,58.1),(308,'치리노스','25  P',2.65,12,12,0,0,0,0,6,2,62.5),(309,'와이스','25  P',2.56,12,12,0,0,0,0,7,2,63.1),(310,'소형준','25  P',2.55,10,10,0,0,0,0,4,2,54.5),(311,'오원석','25  P',2.45,11,11,0,0,0,0,7,2,60),(312,'류현진','25  P',2.41,12,12,0,0,0,0,5,2,58.6),(313,'잭로그','25  P',2.39,12,12,0,0,0,0,3,5,59.9),(314,'박세웅','25  P',2.28,12,12,0,0,0,0,8,3,63.3),(315,'송승기','25  P',2.16,10,10,0,0,0,0,5,3,53.6),(316,'고영표','25  P',2.04,11,11,0,1,1,1,4,4,53.4),(317,'올러','25  P',2.03,11,11,0,0,0,0,5,2,52.8),(318,'라일리','25  P',2,12,12,0,0,0,0,7,3,59),(319,'화이트','25  P',1.78,8,8,0,0,0,0,4,1,41.3),(320,'로젠버그','25  P',1.72,12,12,0,0,0,0,4,4,53.2),(321,'김서현','25  P',1.64,29,0,29,22,0,0,1,1,-2.6),(322,'손동현','25  P',1.6,29,0,29,4,0,0,3,0,16.5),(323,'조병현','25  P',1.57,25,0,25,19,0,0,4,1,4.2),(324,'백정현','25  P',1.45,28,1,27,8,0,0,2,0,11.5),(325,'김광현','25  P',1.43,12,12,0,0,0,0,3,6,51.8),(326,'문승원','25  P',1.42,9,9,0,0,0,0,3,2,39.7),(327,'손주영','25  P',1.41,11,11,0,0,0,0,6,3,49.6),(328,'콜어빈','25  P',1.4,12,12,0,0,0,0,5,5,53),(329,'로건','25  P',1.37,12,12,0,0,0,0,2,6,49.7),(330,'김태훈','25  P',1.36,28,0,28,3,0,0,1,1,13.6),(331,'김도현','25  P',1.36,11,11,0,0,0,0,2,3,43.1),(332,'김원중','25  P',1.34,23,0,23,19,0,0,2,0,-2.6),(333,'문동주','25  P',1.34,10,10,0,1,1,0,5,2,42.9),(334,'헤이수스','25  P',1.34,11,11,0,0,0,0,4,4,47.4),(335,'레예스','25  P',1.34,8,8,0,0,0,0,4,3,39.9),(336,'박영현','25  P',1.3,29,0,29,25,0,0,1,2,-7.5),(337,'이로운','25  P',1.22,29,0,29,2,0,0,2,2,16.2),(338,'신민혁','25  P',1.17,10,10,0,0,0,0,2,3,39.2),(339,'최승용','25  P',1.15,10,10,0,0,0,0,3,2,39),(340,'노경은','25  P',1.06,30,0,30,3,0,0,0,2,10.6),(341,'원상현','25  P',0.96,27,0,27,1,0,0,0,1,10.1),(342,'박상원','25  P',0.91,31,0,31,1,0,0,3,2,15.6),(343,'조동욱','25  P',0.9,24,0,24,5,0,0,0,0,4),(344,'정해영','25  P',0.86,24,0,24,22,0,0,1,2,-8.9),(345,'최원태','25  P',0.84,10,10,0,0,0,0,4,2,37.4),(346,'손주환','25  P',0.83,26,0,26,4,0,0,4,1,11.8),(347,'김진성','25  P',0.83,31,0,31,2,0,0,1,2,10.8),(348,'우규민','25  P',0.83,23,0,23,5,0,0,1,1,6.3),(349,'나균안','25  P',0.81,11,11,0,0,0,0,0,3,34.6),(350,'정철원','25  P',0.81,30,0,30,2,0,0,4,1,13.6);
/*!40000 ALTER TABLE `pitchers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `post_likes`
--

DROP TABLE IF EXISTS `post_likes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `post_likes` (
  `id` int NOT NULL AUTO_INCREMENT,
  `post_id` int DEFAULT NULL,
  `user_email` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `unique_like` (`post_id`,`user_email`),
  CONSTRAINT `post_likes_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `post_likes`
--

LOCK TABLES `post_likes` WRITE;
/*!40000 ALTER TABLE `post_likes` DISABLE KEYS */;
/*!40000 ALTER TABLE `post_likes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `posts`
--

DROP TABLE IF EXISTS `posts`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `posts` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `author` varchar(100) NOT NULL,
  `time` datetime DEFAULT CURRENT_TIMESTAMP,
  `likes` int DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `posts`
--

LOCK TABLES `posts` WRITE;
/*!40000 ALTER TABLE `posts` DISABLE KEYS */;
INSERT INTO `posts` VALUES (16,'asda','asdasd','yobro','2025-05-31 17:32:56',0);
/*!40000 ALTER TABLE `posts` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` int NOT NULL AUTO_INCREMENT,
  `email` varchar(255) NOT NULL,
  `username` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL,
  `team` varchar(100) NOT NULL,
  `image_url` varchar(255) DEFAULT '/Images/user.png',
  PRIMARY KEY (`id`),
  UNIQUE KEY `email` (`email`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'yesyes','yobro','7499724d2fb5d3cc1ce097fef2f4132a8fcdbed1745110c65184e08e073c169','Samsung Lions','/uploads/16b793a927c6742fb02d5f03dc026493'),(2,'hello','qpqp','eb6b09ae4b649a3e39e0e42f3050cfd989bcaa8aacc4663undefined6f89c688d60f','Doosan Bears','/Images/user.png');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-06-01 16:17:12
